Ran Plan for dir: `stacks/teams/team-a` workspace: `default`

<details><summary>Show Output</summary>

```diff
11:19:13.983 WARN   Config ../../platform/kind-cluster/terragrunt.hcl is a dependency of ./terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
11:19:13.985 INFO   Downloading Terraform configurations from . into ./.terragrunt-cache/HwAH71qZ5LGUzyTmDQf6n_5pD_s/g8DtOwK2lkRCqkHfjd8so1R4UT0
11:19:14.040 INFO   tofu: Initializing the backend...
11:19:14.046 INFO   tofu: 
11:19:14.046 INFO   tofu: Successfully configured the backend "local"! OpenTofu will automatically
11:19:14.046 INFO   tofu: use this backend unless the backend configuration changes.
11:19:14.047 INFO   tofu: Initializing provider plugins...
11:19:14.047 INFO   tofu: - Finding hashicorp/kubernetes versions matching "~> 2.27"...
11:19:14.409 INFO   tofu: - Finding latest version of hashicorp/null...
11:19:14.980 INFO   tofu: - Installing hashicorp/kubernetes v2.38.0 to the shared cache directory...
11:19:18.084 INFO   tofu: - Installed hashicorp/kubernetes v2.38.0 (signed, key ID 0C0AF313E5FD9F80)
11:19:18.084 INFO   tofu: - Using hashicorp/kubernetes v2.38.0 from the shared cache directory
11:19:18.391 INFO   tofu: - Installing hashicorp/null v3.2.4 to the shared cache directory...
11:19:19.641 INFO   tofu: - Installed hashicorp/null v3.2.4 (signed, key ID 0C0AF313E5FD9F80)
11:19:19.641 INFO   tofu: - Using hashicorp/null v3.2.4 from the shared cache directory
11:19:19.642 INFO   tofu: Providers are signed by their developers.
11:19:19.642 INFO   tofu: If you'd like to know more about provider signing, you can read about it here:
11:19:19.642 INFO   tofu: https://opentofu.org/docs/cli/plugins/signing/
11:19:19.642 INFO   tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
11:19:19.642 INFO   tofu: selections it made above. Include this file in your version control repository
11:19:19.642 INFO   tofu: so that OpenTofu can guarantee to make the same selections by default when
11:19:19.642 INFO   tofu: you run "tofu init" in the future.
11:19:19.642 INFO   tofu: OpenTofu has been successfully initialized!
11:19:19.642 INFO   tofu: 
11:19:19.642 INFO   tofu: You may now begin working with OpenTofu. Try running "tofu plan" to see
11:19:19.642 INFO   tofu: any changes that are required for your infrastructure. All OpenTofu commands
11:19:19.642 INFO   tofu: should now work.
11:19:19.642 INFO   tofu: If you ever set or change modules or backend configuration for OpenTofu,
11:19:19.642 INFO   tofu: rerun this command to reinitialize your working directory. If you forget, other
11:19:19.642 INFO   tofu: commands will detect it and remind you to do so if necessary.
11:19:20.193 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
11:19:20.193 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
11:19:20.193 STDOUT tofu:   + create
11:19:20.193 STDOUT tofu: OpenTofu will perform the following actions:
11:19:20.193 STDOUT tofu:   # kubernetes_config_map.team_info will be created
11:19:20.193 STDOUT tofu:   + resource "kubernetes_config_map" "team_info" {
11:19:20.193 STDOUT tofu:       + data = (known after apply)
11:19:20.193 STDOUT tofu:       + id   = (known after apply)
11:19:20.193 STDOUT tofu:       + metadata {
11:19:20.193 STDOUT tofu:           + generation       = (known after apply)
11:19:20.193 STDOUT tofu:           + name             = "team-a-info"
11:19:20.193 STDOUT tofu:           + namespace        = "team-a-apps"
11:19:20.193 STDOUT tofu:           + resource_version = (known after apply)
11:19:20.193 STDOUT tofu:           + uid              = (known after apply)
11:19:20.193 STDOUT tofu:         }
11:19:20.193 STDOUT tofu:     }
11:19:20.193 STDOUT tofu:   # kubernetes_deployment.postgres will be created
11:19:20.193 STDOUT tofu:   + resource "kubernetes_deployment" "postgres" {
11:19:20.193 STDOUT tofu:       + id               = (known after apply)
11:19:20.193 STDOUT tofu:       + wait_for_rollout = true
11:19:20.193 STDOUT tofu:       + metadata {
11:19:20.193 STDOUT tofu:           + generation       = (known after apply)
11:19:20.193 STDOUT tofu:           + labels           = {
11:19:20.193 STDOUT tofu:               + "app"  = "postgres"
11:19:20.193 STDOUT tofu:               + "team" = "team-a"
11:19:20.193 STDOUT tofu:             }
11:19:20.193 STDOUT tofu:           + name             = "team-a-postgres"
11:19:20.193 STDOUT tofu:           + namespace        = "team-a-apps"
11:19:20.193 STDOUT tofu:           + resource_version = (known after apply)
11:19:20.193 STDOUT tofu:           + uid              = (known after apply)
11:19:20.193 STDOUT tofu:         }
11:19:20.193 STDOUT tofu:       + spec {
11:19:20.193 STDOUT tofu:           + min_ready_seconds         = 0
11:19:20.193 STDOUT tofu:           + paused                    = false
11:19:20.193 STDOUT tofu:           + progress_deadline_seconds = 600
11:19:20.194 STDOUT tofu:           + replicas                  = "1"
11:19:20.194 STDOUT tofu:           + revision_history_limit    = 10
11:19:20.194 STDOUT tofu:           + selector {
11:19:20.194 STDOUT tofu:               + match_labels = {
11:19:20.194 STDOUT tofu:                   + "app"  = "postgres"
11:19:20.194 STDOUT tofu:                   + "team" = "team-a"
11:19:20.194 STDOUT tofu:                 }
11:19:20.194 STDOUT tofu:             }
11:19:20.194 STDOUT tofu:           + strategy (known after apply)
11:19:20.194 STDOUT tofu:           + template {
11:19:20.194 STDOUT tofu:               + metadata {
11:19:20.194 STDOUT tofu:                   + generation       = (known after apply)
11:19:20.194 STDOUT tofu:                   + labels           = {
11:19:20.194 STDOUT tofu:                       + "app"  = "postgres"
11:19:20.194 STDOUT tofu:                       + "team" = "team-a"
11:19:20.194 STDOUT tofu:                     }
11:19:20.194 STDOUT tofu:                   + name             = (known after apply)
11:19:20.194 STDOUT tofu:                   + resource_version = (known after apply)
11:19:20.194 STDOUT tofu:                   + uid              = (known after apply)
11:19:20.194 STDOUT tofu:                 }
11:19:20.194 STDOUT tofu:               + spec {
11:19:20.194 STDOUT tofu:                   + automount_service_account_token  = true
11:19:20.194 STDOUT tofu:                   + dns_policy                       = "ClusterFirst"
11:19:20.194 STDOUT tofu:                   + enable_service_links             = true
11:19:20.194 STDOUT tofu:                   + host_ipc                         = false
11:19:20.194 STDOUT tofu:                   + host_network                     = false
11:19:20.194 STDOUT tofu:                   + host_pid                         = false
11:19:20.194 STDOUT tofu:                   + hostname                         = (known after apply)
11:19:20.194 STDOUT tofu:                   + node_name                        = (known after apply)
11:19:20.194 STDOUT tofu:                   + restart_policy                   = "Always"
11:19:20.194 STDOUT tofu:                   + scheduler_name                   = (known after apply)
11:19:20.194 STDOUT tofu:                   + service_account_name             = (known after apply)
11:19:20.194 STDOUT tofu:                   + share_process_namespace          = false
11:19:20.194 STDOUT tofu:                   + termination_grace_period_seconds = 30
11:19:20.194 STDOUT tofu:                   + container {
11:19:20.194 STDOUT tofu:                       + image                      = "postgres:15-alpine"
11:19:20.195 STDOUT tofu:                       + image_pull_policy          = (known after apply)
11:19:20.195 STDOUT tofu:                       + name                       = "postgres"
11:19:20.196 STDOUT tofu:                       + stdin                      = false
11:19:20.196 STDOUT tofu:                       + stdin_once                 = false
11:19:20.196 STDOUT tofu:                       + termination_message_path   = "/dev/termination-log"
11:19:20.196 STDOUT tofu:                       + termination_message_policy = (known after apply)
11:19:20.196 STDOUT tofu:                       + tty                        = false
11:19:20.197 STDOUT tofu:                       + env {
11:19:20.197 STDOUT tofu:                           + name  = "POSTGRES_USER"
11:19:20.197 STDOUT tofu:                           + value = "team-a"
11:19:20.197 STDOUT tofu:                         }
11:19:20.197 STDOUT tofu:                       + env {
11:19:20.197 STDOUT tofu:                           + name  = "POSTGRES_PASSWORD"
11:19:20.197 STDOUT tofu:                           + value = "demo-password-team-a"
11:19:20.197 STDOUT tofu:                         }
11:19:20.197 STDOUT tofu:                       + env {
11:19:20.197 STDOUT tofu:                           + name  = "POSTGRES_DB"
11:19:20.197 STDOUT tofu:                           + value = "team-a_db"
11:19:20.197 STDOUT tofu:                         }
11:19:20.197 STDOUT tofu:                       + liveness_probe {
11:19:20.198 STDOUT tofu:                           + failure_threshold     = 3
11:19:20.198 STDOUT tofu:                           + initial_delay_seconds = 30
11:19:20.198 STDOUT tofu:                           + period_seconds        = 10
11:19:20.198 STDOUT tofu:                           + success_threshold     = 1
11:19:20.198 STDOUT tofu:                           + timeout_seconds       = 1
11:19:20.198 STDOUT tofu:                           + exec {
11:19:20.198 STDOUT tofu:                               + command = [
11:19:20.198 STDOUT tofu:                                   + "pg_isready",
11:19:20.198 STDOUT tofu:                                   + "-U",
11:19:20.198 STDOUT tofu:                                   + "team-a",
11:19:20.198 STDOUT tofu:                                 ]
11:19:20.198 STDOUT tofu:                             }
11:19:20.198 STDOUT tofu:                         }
11:19:20.198 STDOUT tofu:                       + port {
11:19:20.198 STDOUT tofu:                           + container_port = 5432
11:19:20.198 STDOUT tofu:                           + name           = "postgres"
11:19:20.198 STDOUT tofu:                           + protocol       = "TCP"
11:19:20.198 STDOUT tofu:                         }
11:19:20.198 STDOUT tofu:                       + readiness_probe {
11:19:20.198 STDOUT tofu:                           + failure_threshold     = 3
11:19:20.198 STDOUT tofu:                           + initial_delay_seconds = 5
11:19:20.198 STDOUT tofu:                           + period_seconds        = 5
11:19:20.198 STDOUT tofu:                           + success_threshold     = 1
11:19:20.198 STDOUT tofu:                           + timeout_seconds       = 1
11:19:20.198 STDOUT tofu:                           + exec {
11:19:20.198 STDOUT tofu:                               + command = [
11:19:20.199 STDOUT tofu:                                   + "pg_isready",
11:19:20.199 STDOUT tofu:                                   + "-U",
11:19:20.199 STDOUT tofu:                                   + "team-a",
11:19:20.199 STDOUT tofu:                                 ]
11:19:20.199 STDOUT tofu:                             }
11:19:20.199 STDOUT tofu:                         }
11:19:20.199 STDOUT tofu:                       + resources {
11:19:20.199 STDOUT tofu:                           + limits   = {
11:19:20.199 STDOUT tofu:                               + "cpu"    = "500m"
11:19:20.199 STDOUT tofu:                               + "memory" = "512Mi"
11:19:20.199 STDOUT tofu:                             }
11:19:20.199 STDOUT tofu:                           + requests = {
11:19:20.199 STDOUT tofu:                               + "cpu"    = "250m"
11:19:20.199 STDOUT tofu:                               + "memory" = "256Mi"
11:19:20.199 STDOUT tofu:                             }
11:19:20.199 STDOUT tofu:                         }
11:19:20.199 STDOUT tofu:                     }
11:19:20.199 STDOUT tofu:                   + image_pull_secrets (known after apply)
11:19:20.199 STDOUT tofu:                   + readiness_gate (known after apply)
11:19:20.199 STDOUT tofu:                 }
11:19:20.199 STDOUT tofu:             }
11:19:20.199 STDOUT tofu:         }
11:19:20.199 STDOUT tofu:     }
11:19:20.199 STDOUT tofu:   # kubernetes_deployment.sample_app will be created
11:19:20.199 STDOUT tofu:   + resource "kubernetes_deployment" "sample_app" {
11:19:20.199 STDOUT tofu:       + id               = (known after apply)
11:19:20.199 STDOUT tofu:       + wait_for_rollout = true
11:19:20.199 STDOUT tofu:       + metadata {
11:19:20.199 STDOUT tofu:           + generation       = (known after apply)
11:19:20.199 STDOUT tofu:           + labels           = {
11:19:20.199 STDOUT tofu:               + "app"  = "sample-app"
11:19:20.199 STDOUT tofu:               + "team" = "team-a"
11:19:20.199 STDOUT tofu:             }
11:19:20.199 STDOUT tofu:           + name             = "team-a-sample-app"
11:19:20.199 STDOUT tofu:           + namespace        = "team-a-apps"
11:19:20.199 STDOUT tofu:           + resource_version = (known after apply)
11:19:20.199 STDOUT tofu:           + uid              = (known after apply)
11:19:20.199 STDOUT tofu:         }
11:19:20.199 STDOUT tofu:       + spec {
11:19:20.199 STDOUT tofu:           + min_ready_seconds         = 0
11:19:20.199 STDOUT tofu:           + paused                    = false
11:19:20.199 STDOUT tofu:           + progress_deadline_seconds = 600
11:19:20.199 STDOUT tofu:           + replicas                  = "2"
11:19:20.200 STDOUT tofu:           + revision_history_limit    = 10
11:19:20.200 STDOUT tofu:           + selector {
11:19:20.200 STDOUT tofu:               + match_labels = {
11:19:20.200 STDOUT tofu:                   + "app"  = "sample-app"
11:19:20.200 STDOUT tofu:                   + "team" = "team-a"
11:19:20.200 STDOUT tofu:                 }
11:19:20.200 STDOUT tofu:             }
11:19:20.200 STDOUT tofu:           + strategy (known after apply)
11:19:20.200 STDOUT tofu:           + template {
11:19:20.200 STDOUT tofu:               + metadata {
11:19:20.200 STDOUT tofu:                   + generation       = (known after apply)
11:19:20.200 STDOUT tofu:                   + labels           = {
11:19:20.200 STDOUT tofu:                       + "app"  = "sample-app"
11:19:20.200 STDOUT tofu:                       + "team" = "team-a"
11:19:20.200 STDOUT tofu:                     }
11:19:20.200 STDOUT tofu:                   + name             = (known after apply)
11:19:20.200 STDOUT tofu:                   + resource_version = (known after apply)
11:19:20.200 STDOUT tofu:                   + uid              = (known after apply)
11:19:20.200 STDOUT tofu:                 }
11:19:20.200 STDOUT tofu:               + spec {
11:19:20.200 STDOUT tofu:                   + automount_service_account_token  = true
11:19:20.200 STDOUT tofu:                   + dns_policy                       = "ClusterFirst"
11:19:20.200 STDOUT tofu:                   + enable_service_links             = true
11:19:20.200 STDOUT tofu:                   + host_ipc                         = false
11:19:20.200 STDOUT tofu:                   + host_network                     = false
11:19:20.200 STDOUT tofu:                   + host_pid                         = false
11:19:20.200 STDOUT tofu:                   + hostname                         = (known after apply)
11:19:20.200 STDOUT tofu:                   + node_name                        = (known after apply)
11:19:20.200 STDOUT tofu:                   + restart_policy                   = "Always"
11:19:20.200 STDOUT tofu:                   + scheduler_name                   = (known after apply)
11:19:20.200 STDOUT tofu:                   + service_account_name             = (known after apply)
11:19:20.200 STDOUT tofu:                   + share_process_namespace          = false
11:19:20.200 STDOUT tofu:                   + termination_grace_period_seconds = 30
11:19:20.200 STDOUT tofu:                   + container {
11:19:20.200 STDOUT tofu:                       + image                      = "nginx:1.27-alpine"
11:19:20.200 STDOUT tofu:                       + image_pull_policy          = (known after apply)
11:19:20.201 STDOUT tofu:                       + name                       = "nginx"
11:19:20.201 STDOUT tofu:                       + stdin                      = false
11:19:20.201 STDOUT tofu:                       + stdin_once                 = false
11:19:20.201 STDOUT tofu:                       + termination_message_path   = "/dev/termination-log"
11:19:20.201 STDOUT tofu:                       + termination_message_policy = (known after apply)
11:19:20.201 STDOUT tofu:                       + tty                        = false
11:19:20.201 STDOUT tofu:                       + liveness_probe {
11:19:20.201 STDOUT tofu:                           + failure_threshold     = 3
11:19:20.201 STDOUT tofu:                           + initial_delay_seconds = 10
11:19:20.201 STDOUT tofu:                           + period_seconds        = 5
11:19:20.201 STDOUT tofu:                           + success_threshold     = 1
11:19:20.201 STDOUT tofu:                           + timeout_seconds       = 1
11:19:20.201 STDOUT tofu:                           + http_get {
11:19:20.201 STDOUT tofu:                               + path   = "/"
11:19:20.201 STDOUT tofu:                               + port   = "80"
11:19:20.201 STDOUT tofu:                               + scheme = "HTTP"
11:19:20.201 STDOUT tofu:                             }
11:19:20.201 STDOUT tofu:                         }
11:19:20.201 STDOUT tofu:                       + port {
11:19:20.201 STDOUT tofu:                           + container_port = 80
11:19:20.201 STDOUT tofu:                           + protocol       = "TCP"
11:19:20.201 STDOUT tofu:                         }
11:19:20.201 STDOUT tofu:                       + readiness_probe {
11:19:20.201 STDOUT tofu:                           + failure_threshold     = 3
11:19:20.201 STDOUT tofu:                           + initial_delay_seconds = 5
11:19:20.201 STDOUT tofu:                           + period_seconds        = 3
11:19:20.201 STDOUT tofu:                           + success_threshold     = 1
11:19:20.201 STDOUT tofu:                           + timeout_seconds       = 1
11:19:20.201 STDOUT tofu:                           + http_get {
11:19:20.201 STDOUT tofu:                               + path   = "/"
11:19:20.201 STDOUT tofu:                               + port   = "80"
11:19:20.201 STDOUT tofu:                               + scheme = "HTTP"
11:19:20.201 STDOUT tofu:                             }
11:19:20.201 STDOUT tofu:                         }
11:19:20.201 STDOUT tofu:                       + resources {
11:19:20.201 STDOUT tofu:                           + limits   = {
11:19:20.201 STDOUT tofu:                               + "cpu"    = "200m"
11:19:20.201 STDOUT tofu:                               + "memory" = "256Mi"
11:19:20.201 STDOUT tofu:                             }
11:19:20.201 STDOUT tofu:                           + requests = {
11:19:20.202 STDOUT tofu:                               + "cpu"    = "100m"
11:19:20.202 STDOUT tofu:                               + "memory" = "128Mi"
11:19:20.202 STDOUT tofu:                             }
11:19:20.202 STDOUT tofu:                         }
11:19:20.202 STDOUT tofu:                     }
11:19:20.202 STDOUT tofu:                   + image_pull_secrets (known after apply)
11:19:20.202 STDOUT tofu:                   + readiness_gate (known after apply)
11:19:20.202 STDOUT tofu:                 }
11:19:20.202 STDOUT tofu:             }
11:19:20.202 STDOUT tofu:         }
11:19:20.202 STDOUT tofu:     }
11:19:20.202 STDOUT tofu:   # kubernetes_namespace.app will be created
11:19:20.202 STDOUT tofu:   + resource "kubernetes_namespace" "app" {
11:19:20.202 STDOUT tofu:       + id                               = (known after apply)
11:19:20.202 STDOUT tofu:       + wait_for_default_service_account = false
11:19:20.202 STDOUT tofu:       + metadata {
11:19:20.202 STDOUT tofu:           + generation       = (known after apply)
11:19:20.202 STDOUT tofu:           + labels           = {
11:19:20.202 STDOUT tofu:               + "managed-by" = "terragrunt"
11:19:20.202 STDOUT tofu:               + "project"    = "opentofu-platform-demo"
11:19:20.202 STDOUT tofu:               + "team"       = "team-a"
11:19:20.202 STDOUT tofu:             }
11:19:20.202 STDOUT tofu:           + name             = "team-a-apps"
11:19:20.202 STDOUT tofu:           + resource_version = (known after apply)
11:19:20.202 STDOUT tofu:           + uid              = (known after apply)
11:19:20.202 STDOUT tofu:         }
11:19:20.202 STDOUT tofu:     }
11:19:20.202 STDOUT tofu:   # kubernetes_secret.db_credentials will be created
11:19:20.202 STDOUT tofu:   + resource "kubernetes_secret" "db_credentials" {
11:19:20.202 STDOUT tofu:       + data                           = (sensitive value)
11:19:20.202 STDOUT tofu:       + id                             = (known after apply)
11:19:20.202 STDOUT tofu:       + type                           = "Opaque"
11:19:20.202 STDOUT tofu:       + wait_for_service_account_token = true
11:19:20.202 STDOUT tofu:       + metadata {
11:19:20.202 STDOUT tofu:           + generation       = (known after apply)
11:19:20.202 STDOUT tofu:           + name             = "team-a-db-credentials"
11:19:20.202 STDOUT tofu:           + namespace        = "team-a-apps"
11:19:20.202 STDOUT tofu:           + resource_version = (known after apply)
11:19:20.202 STDOUT tofu:           + uid              = (known after apply)
11:19:20.202 STDOUT tofu:         }
11:19:20.202 STDOUT tofu:     }
11:19:20.202 STDOUT tofu:   # kubernetes_service.postgres will be created
11:19:20.202 STDOUT tofu:   + resource "kubernetes_service" "postgres" {
11:19:20.202 STDOUT tofu:       + id                     = (known after apply)
11:19:20.202 STDOUT tofu:       + status                 = (known after apply)
11:19:20.202 STDOUT tofu:       + wait_for_load_balancer = true
11:19:20.202 STDOUT tofu:       + metadata {
11:19:20.202 STDOUT tofu:           + generation       = (known after apply)
11:19:20.202 STDOUT tofu:           + name             = "team-a-postgres"
11:19:20.203 STDOUT tofu:           + namespace        = "team-a-apps"
11:19:20.203 STDOUT tofu:           + resource_version = (known after apply)
11:19:20.203 STDOUT tofu:           + uid              = (known after apply)
11:19:20.203 STDOUT tofu:         }
11:19:20.203 STDOUT tofu:       + spec {
11:19:20.203 STDOUT tofu:           + allocate_load_balancer_node_ports = true
11:19:20.203 STDOUT tofu:           + cluster_ip                        = (known after apply)
11:19:20.203 STDOUT tofu:           + cluster_ips                       = (known after apply)
11:19:20.203 STDOUT tofu:           + external_traffic_policy           = (known after apply)
11:19:20.203 STDOUT tofu:           + health_check_node_port            = (known after apply)
11:19:20.203 STDOUT tofu:           + internal_traffic_policy           = (known after apply)
11:19:20.203 STDOUT tofu:           + ip_families                       = (known after apply)
11:19:20.203 STDOUT tofu:           + ip_family_policy                  = (known after apply)
11:19:20.203 STDOUT tofu:           + publish_not_ready_addresses       = false
11:19:20.203 STDOUT tofu:           + selector                          = {
11:19:20.203 STDOUT tofu:               + "app"  = "postgres"
11:19:20.203 STDOUT tofu:               + "team" = "team-a"
11:19:20.203 STDOUT tofu:             }
11:19:20.203 STDOUT tofu:           + session_affinity                  = "None"
11:19:20.203 STDOUT tofu:           + type                              = "ClusterIP"
11:19:20.203 STDOUT tofu:           + port {
11:19:20.203 STDOUT tofu:               + node_port   = (known after apply)
11:19:20.203 STDOUT tofu:               + port        = 5432
11:19:20.203 STDOUT tofu:               + protocol    = "TCP"
11:19:20.203 STDOUT tofu:               + target_port = "5432"
11:19:20.203 STDOUT tofu:             }
11:19:20.203 STDOUT tofu:           + session_affinity_config (known after apply)
11:19:20.203 STDOUT tofu:         }
11:19:20.203 STDOUT tofu:     }
11:19:20.203 STDOUT tofu:   # kubernetes_service.sample_app will be created
11:19:20.203 STDOUT tofu:   + resource "kubernetes_service" "sample_app" {
11:19:20.203 STDOUT tofu:       + id                     = (known after apply)
11:19:20.203 STDOUT tofu:       + status                 = (known after apply)
11:19:20.203 STDOUT tofu:       + wait_for_load_balancer = true
11:19:20.203 STDOUT tofu:       + metadata {
11:19:20.203 STDOUT tofu:           + generation       = (known after apply)
11:19:20.203 STDOUT tofu:           + name             = "team-a-sample-app"
11:19:20.203 STDOUT tofu:           + namespace        = "team-a-apps"
11:19:20.203 STDOUT tofu:           + resource_version = (known after apply)
11:19:20.204 STDOUT tofu:           + uid              = (known after apply)
11:19:20.204 STDOUT tofu:         }
11:19:20.204 STDOUT tofu:       + spec {
11:19:20.204 STDOUT tofu:           + allocate_load_balancer_node_ports = true
11:19:20.204 STDOUT tofu:           + cluster_ip                        = (known after apply)
11:19:20.204 STDOUT tofu:           + cluster_ips                       = (known after apply)
11:19:20.204 STDOUT tofu:           + external_traffic_policy           = (known after apply)
11:19:20.204 STDOUT tofu:           + health_check_node_port            = (known after apply)
11:19:20.204 STDOUT tofu:           + internal_traffic_policy           = (known after apply)
11:19:20.204 STDOUT tofu:           + ip_families                       = (known after apply)
11:19:20.204 STDOUT tofu:           + ip_family_policy                  = (known after apply)
11:19:20.204 STDOUT tofu:           + publish_not_ready_addresses       = false
11:19:20.204 STDOUT tofu:           + selector                          = {
11:19:20.204 STDOUT tofu:               + "app"  = "sample-app"
11:19:20.204 STDOUT tofu:               + "team" = "team-a"
11:19:20.204 STDOUT tofu:             }
11:19:20.204 STDOUT tofu:           + session_affinity                  = "None"
11:19:20.204 STDOUT tofu:           + type                              = "ClusterIP"
11:19:20.204 STDOUT tofu:           + port {
11:19:20.204 STDOUT tofu:               + node_port   = (known after apply)
11:19:20.204 STDOUT tofu:               + port        = 80
11:19:20.204 STDOUT tofu:               + protocol    = "TCP"
11:19:20.204 STDOUT tofu:               + target_port = "80"
11:19:20.204 STDOUT tofu:             }
11:19:20.204 STDOUT tofu:           + session_affinity_config (known after apply)
11:19:20.204 STDOUT tofu:         }
11:19:20.204 STDOUT tofu:     }
11:19:20.204 STDOUT tofu:   # null_resource.example1 will be created
11:19:20.204 STDOUT tofu:   + resource "null_resource" "example1" {
11:19:20.204 STDOUT tofu:       + id = (known after apply)
11:19:20.204 STDOUT tofu:     }
11:19:20.204 STDOUT tofu: Plan: 8 to add, 0 to change, 0 to destroy.
11:19:20.204 STDOUT tofu: 
11:19:20.204 STDOUT tofu: Changes to Outputs:
11:19:20.204 STDOUT tofu:   + database_name      = "team-a_db"
11:19:20.204 STDOUT tofu:   + namespace          = "team-a-apps"
11:19:20.204 STDOUT tofu:   + postgres_endpoint  = "team-a-postgres.team-a-apps.svc.cluster.local:5432"
11:19:20.204 STDOUT tofu:   + resources_deployed = [
11:19:20.204 STDOUT tofu:       + "namespace: team-a-apps",
11:19:20.204 STDOUT tofu:       + "deployment: team-a-sample-app",
11:19:20.204 STDOUT tofu:       + "service: team-a-sample-app",
11:19:20.204 STDOUT tofu:       + "postgres-deployment: team-a-postgres",
11:19:20.204 STDOUT tofu:       + "postgres-service: team-a-postgres",
11:19:20.204 STDOUT tofu:       + "secret: team-a-db-credentials",
11:19:20.204 STDOUT tofu:     ]
11:19:20.204 STDOUT tofu:   + sample_app_service = {
11:19:20.204 STDOUT tofu:       + endpoint  = "team-a-sample-app.team-a-apps.svc.cluster.local"
11:19:20.204 STDOUT tofu:       + name      = "team-a-sample-app"
11:19:20.205 STDOUT tofu:       + namespace = "team-a-apps"
11:19:20.205 STDOUT tofu:     }
11:19:20.205 STDOUT tofu:   + team_name          = "team-a"
11:19:20.205 STDOUT tofu: 
11:19:20.205 STDOUT tofu: ─────────────────────────────────────────────────────────────────────────────
11:19:20.205 STDOUT tofu: Saved the plan to:
11:19:20.205 STDOUT tofu: ./default.tfplan
11:19:20.205 STDOUT tofu: To perform exactly these actions, run the following command to apply:
11:19:20.205 STDOUT tofu:     tofu apply "./default.tfplan"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d stacks/teams/team-a
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://53c332340d8a.ngrok-free.app/lock?id=gracebrickley%252Fopentofudemo%252Fstacks%252Fteams%252Fteam-a%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d stacks/teams/team-a
  ```
Plan: 8 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```